export const egyptianCities  = [
  "القاهرة", "الجيزة", "الإسكندرية", "القليوبية", "الدقهلية", 
  "الشرقية", "الغربية", "المنوفية", "البحيرة", "كفر الشيخ", 
  "دمياط", "بورسعيد", "الإسماعيلية", "السويس", "الفيوم", 
  "بني سويف", "المنيا", "أسيوط", "سوهاج", "قنا", 
  "الأقصر", "أسوان", "البحر الأحمر", "الوادي الجديد", "مطروح", 
  "شمال سيناء", "جنوب سيناء"
];

export const egyptianCities: Record<string, string[]> = {
  "القاهرة": [
    "وسط البلد", "المعادي", "مدينة نصر", "مصر الجديدة", "العباسية", "حلوان", "شبرا", 
    "عين شمس", "التجمع الخامس", "الزمالك", "المرج", "السيدة زينب", "المطرية", "الوايلي", 
    "المنيل", "الخانكة", "العبور", "القاهرة الجديدة", "الشيخ زايد", "بدر", "15 مايو", 
    "المقطم", "النزهة", "الزيتون", "الزاوية الحمراء", "السلام", "طرة", "دار السلام", 
    "البساتين", "حدائق القبة", "الماظة", "مصر القديمة", "منشأة ناصر", "غرب القاهرة", 
    "شرق القاهرة"
  ],
  "الجيزة": [
    "6 أكتوبر", "بولاق الدكرور", "الدقي", "العجوزة", "الهرم", "البدرشين", "كرداسة", 
    "أطفيح", "الصف", "العياط", "الواحات البحرية", "منشأة القناطر", "أوسيم", "كفر حكيم", 
    "أبو النمرس", "الوراق", "المنيب", "إمبابة", "المناشي", "العمرانية", "الطالبية", 
    "أبو رواش", "كفر غطاطي"
  ],
  "الإسكندرية": [
    "العجمي", "سيدي جابر", "المنتزه", "العصافرة", "محرم بك", "سموحة", "العامرية", 
    "باكوس", "الورديان", "الأنفوشي", "كامب شيزار", "رأس التين", "المندرة", "السيوف", 
    "البيطاش", "الابراهيمية", "الظاهرية", "اللبان", "السرايا", "المنشية", "كليوباترا", 
    "المعمورة"
  ],
  "القليوبية": [
    "بنها", "شبرا الخيمة", "القناطر الخيرية", "الخانكة", "كفر شكر", "طوخ", "قليوب",
    "العبور", "شبين القناطر", "الخصوص", "قها", "مدينة 15 مايو"
  ],
  "الدقهلية": [
    "المنصورة", "المحلة الكبرى", "دمياط", "طلخا", "السنبلاوين", "أجا", "ميت غمر",
    "المنزلة", "بلقاس", "دكرنس", "شربين", "تمى الأمديد", "الجمالية", "ميت سلسيل",
    "بني عبيد", "المنصورة الجديدة"
  ],
  "الشرقية": [
    "الزقازيق", "العاشر من رمضان", "بلبيس", "منيا القمح", "ههيا", "أبو كبير", "ديرب نجم",
    "الإبراهيمية", "كفر صقر", "أولاد صقر", "القنايات", "مشتول السوق", "القرين", "أبو حماد",
    "الصالحية الجديدة", "الحسينية", "الرضوانية"
  ],
  "الغربية": [
    "طنطا", "المحلة الكبرى", "كفر الزيات", "زفتى", "السنطة", "قطور", "بسيون", "سمنود"
  ],
  "المنوفية": [
    "شبين الكوم", "السادات", "منوف", "أشمون", "الباجور", "قويسنا", "بركة السبع", "تلا",
    "سرس الليان", "الشهداء"
  ],
  "البحيرة": [
    "دمنهور", "كفر الدوار", "إدكو", "أبو المطامير", "أبو حمص", "الدلنجات", "المحمودية",
    "الرحمانية", "إيتاي البارود", "حوش عيسى", "كوم حمادة", "بدر", "وادي النطرون", "النوبارية الجديدة"
  ],
  "كفر الشيخ": [
    "كفر الشيخ", "دسوق", "فوه", "مطوبس", "بيلا", "الحامول", "الرياض", "سيدي سالم",
    "قلين", "سيدي غازي", "مسير", "برج البرلس"
  ],
  "دمياط": [
    "دمياط", "دمياط الجديدة", "رأس البر", "الزرقا", "السرو", "فارسكور", "ميت أبو غالب",
    "كفر سعد", "عزبة البرج"
  ],
  "بورسعيد": [
    "بورسعيد", "بورفؤاد", "الزهور", "المناخ", "العرب", "الشرق", "الضواحي", "الجنوب"
  ],
  "الإسماعيلية": [
    "الإسماعيلية", "فايد", "القنطرة شرق", "القنطرة غرب", "التل الكبير", "أبو صوير المحطة",
    "القصاصين الجديدة"
  ],
  "السويس": [
    "السويس", "عتاقة", "العين السخنة", "فيصل", "الأربعين", "السلام", "حى الكويت"
  ],
  "الفيوم": [
    "الفيوم", "الفيوم الجديدة", "سنورس", "إطسا", "طامية", "أبشواي", "يوسف الصديق",
    "الحادقة", "الشواشنة"
  ],
  "بني سويف": [
    "بني سويف", "بني سويف الجديدة", "الواسطى", "ناصر", "إهناسيا", "ببا", "سمسطا",
    "الفشن"
  ],
  "المنيا": [
    "المنيا", "المنيا الجديدة", "العدوة", "مغاغة", "بني مزار", "مطاي", "سمالوط",
    "المدينة الفكرية", "ملوي", "دير مواس"
  ],
  "أسيوط": [
    "أسيوط", "أسيوط الجديدة", "ديروط", "منفلوط", "القوصية", "أبنوب", "أبو تيج",
    "صدفا", "الغنايم", "ساحل سليم", "البداري", "الفتح"
  ],
  "سوهاج": [
    "سوهاج", "أخميم", "أخميم الجديدة", "البلينا", "جرجا", "المنشاة", "دار السلام",
    "ساقلتة", "طهطا", "طما", "المراغة", "جهينة الغربية", "الكوثر"
  ],
  "قنا": [
    "قنا", "قنا الجديدة", "دشنا", "نجع حمادي", "الوقف", "أبو تشت", "فرشوط",
    "الشرقية", "الغربية", "الحجيرات", "القارة", "المحروسة"
  ],
  "الأقصر": [
    "الأقصر", "الأقصر الجديدة", "إسنا", "أرمنت", "الطود", "القرنة", "الزينية",
    "البياضية", "الضبعية", "العشي", "المنشأة العماري", "المدامود"
  ],
  "أسوان": [
    "أسوان", "أسوان الجديدة", "دراو", "كوم أمبو", "نصر النوبة", "كلابشة", "أبو سمبل",
    "الرديسية", "البصيلية", "العلاقي", "السباعية", "إدفو"
  ],
  "البحر الأحمر": [
    "الغردقة", "رأس غارب", "سفاجا", "القصير", "مرسى علم", "الشلاتين", "حلايب",
    "أبو رماد"
  ],
  "الوادي الجديد": [
    "الخارجة", "الداخلة", "الفرافرة", "باريس", "موط", "بلاط", "تنيدة",
    "العيون", "المنيرة", "القصر الإسلامي"
  ],
  "مطروح": [
    "مرسى مطروح", "الحمام", "العلمين", "الضبعة", "سيدي براني", "السلوم", "سيوة",
    "رأس الحكمة", "النجيلة", "برج العرب"
  ],
  "شمال سيناء": [
    "العريش", "الشيخ زويد", "رفح", "بئر العبد", "نخل", "الحسنة", "القسيمة",
    "رمانة", "الميدان", "الجورة"
  ],
  "جنوب سيناء": [
    "شرم الشيخ", "الطور", "دهب", "نويبع", "طابا", "سانت كاترين", "رأس سدر",
    "أبو زنيمة", "أبو رديس"
  ]
};
